<div class ="header-content">
    <div class="intro">
        <h1 class="place">Как найти свое увлечение?</h1>
        <h2 class="place2">У каждого человека есть хобби, некое занятие для досуга и души, чтобы отвлечься от учебы.
            Хобби - замечательное лекарство от стресса, возможность сконцентрироваться,
            хотя основная цель хобби - развитие кругозора. У каждого хобби может быть разным, кто путешествует,
            кто читает литературу или коллекционирует марки, а кто занимается экстремальными видами спорта.
            Здесь вы узнаете какие виды увлечений бывают.</h2>

    </div>
    <hr>
</div>
