<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">

    <title>Как найти свое увлечение?</title>
    <meta name="description" content="Лабораторная работа студентки группы КС-28 Юдиной Элеоноры Алексеевны"/>
    <link rel="shortcut icon" href="images/favicon.png" type="image/png">
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Vollkorn&display=swap" rel="stylesheet">
    <link rel = "stylesheet" href="css/style.css">
</head>

<body>
<?php
require_once 'header.php';
require_once 'h1.php';

?>
  <div class="navi">
     <nav>

        <div class="oglav">
          <h2 class="oglavl">Категории увлечений, более распространенных у студентов:</h2>
             <div style="display: inline-block; vertical-align: top;">
                1. <a href="#zag1">Спорт</a> <br>
                2. <a href="#zag2">Программирование</a> <br>
                3. <a href="#zag3">Наука</a> <br>
             </div>
            <div style="display: inline-block; margin-left: 20px; vertical-align: top;">
                4. <a href="#zag4">Кулинария</a> <br>

                5. <a href="#zag5">Творчество</a> <br>
            </div>
            <div style="display: inline-block; margin-left: 20px; vertical-align: top;">

                6. <a href="#zag6">Коллекционирование</a> <br>
                7. <a href="#zag7">Блог</a> <br>
            </div>
        </div>

     </nav>



      <main>
           <h2 class="img" id = "zag1"> 1. Спорт</h2>
           <div class="sport" style="">
               <p>
                   Без спорта наша жизнь была бы не такой интересной.Движение – это в любом случае жизнь и нужно что-то делать,
                   чтобы оставаться здоровым. Некоторые занимаются спортом с детства потому что туда
                   их отдают родители, а кто-то, только дожив до сознательного возраста, а то и очень
                   сознательного, внезапно понимает, что хорошо бы спортом заняться.
               <p> <b>Йога и медитации.</b> Какой вид спорта выбрать, если хочешь порелаксировать с нагрузкой?
                   Сочетание силовых и медитации – это конечно же, йога. Влиться в йогу можно в любом возрасте.
                   Есть и дети, и пожилые люди, которые жить не могут без йоги. Ты можешь начать с нуля и в 25
                   и в 30, и в 40. Значение имеет лишь твоё желание. Хорошо может помочь приложение Down dog.
                   Если ты хочешь попробовать, без покупки, то у них есть вариант на полгода бесплатно, если
                   у тебя, к примеру, не хватает денежных средств на покупку приложения. Но вообще цена не
                   высокая. За 1100 рублей в год ты получишь полноценного онлайн тренера йоги, который поможет
                   тебе постичь азы этой практики. Достаточно выгодно при условии, что это цена среднего заказа
                   роллов в ресторане. Три набора и приложение на год твое. Там всё рассчитано на твой уровень
                   . Который ты можешь со временем повышать. Медитация поможет тебе быть более уравновешенным если ты ощущаешь стресс, также очень хорошо работает медитация вместе с йогой. Польза для тела и души одновременно. Медитация также помогает легче засыпать и просыпаться, и выдерживать нервяк, связанный с рабочими вопросами. Как важно правильно дышать, ты, наверное, знаешь сам. Во время практики медитации ты научишься делать это правильно и с пользой для организма.
                   </p>
               <div class="img">

               <img src="images/yoga.jpg" alt="sport" class="imgg"  style="width: 500px">
               <img src="images/yoga1.jpg" alt="sport" class="imgg"  style="width: 500px">
               </div>
               <p> <b>Плавание.</b> Настоящее спасение для офисных работников с сидячей работой, да и не только для них. Пересмотри свои приоритеты и запишись на уроки плавания если ещё не умеешь, или же просто возьми абонемент в бассейн. Это поможет твоей спине и пояснице разгрузиться и мышцы можно будет неплохо размять. После плавания, если ты будешь ходить на него регулярно, улучшится твой сон и настроение в целом. Это очень важно, ведь от качества сна зависит качество работы, а от настроения и работа и поведение в семье. Ты не должен ныть или быть агрессивным. Плавание позволит избавиться от этого, развить свои легкие и стать спокойнее. Улучшение фигуры будет приятным бонусом. Плюсы плавания в том, что ты точно не травмируешься. Ну разве что, на скользкой дорожке к бассейну. Также твои мышцы будут благодарны тебе за такую приятную и обстоятельно нагрузку. Скажет тебе спасибо и психика, потому что сочетание воды и физической нагрузки хорошо избавляет от стресса. Если ты хочешь похудеть, плавание вряд ли тебе подойдет, потому что несмотря на тренировку, быстрого эффекта добиться не выйдет. Если хочется быть качком со вздымающейся грудой мышц, то плавание тоже не подойдёт, Но оно вполне отвечает на вопрос: какой вид спорта выбрать, если ты просто хочешь заниматься спортом.
               <div class="img">

                   <img src="images/swim.jpg" alt="sport" class="imgg"  style="width: 500px">
                   <img src="images/swim1.jpg" alt="sport" class="imgg"  style="width: 500px">
               </div>
               <p><b>Фитнес.</b>Фитнес нынче объединяет в себе многие виды оздоровления и укрепления тела, а еще так называются клубы, представляющие собой тренажёрные залы с некоторыми разделениями на группы посетителей. Там и аэробика недалеко, и пилатес.
                   Фитнес довольно привлекателен тем, что если ты будешь заниматься на тренажерах, то быстро достигнешь результата. Не забудь, что если тебе хочется похудеть, то в любом виде спорта нужно будет поправить своё питание. Это должно зависеть от того, каких результатов ты хочешь достичь. Также плюс в том, что фитнес универсален, и ты можешь каждый день выбирать для себя что-то новое. Выстраивать свою тренировку так как тебе хочется. Конечно, у фитнеса есть и минусы. Например, это стоимость абонемента, которая обычно не очень низкая. А ещё если ты будешь подходить к тренировкам безалаберно, то рискуешь травмироваться. Также любая монотонность в тренировках может очень скоро тебе наскучить и ты просто их забросишь.


               </p>
               <div class="img">

                   <img src="images/sport.jpg" alt="sport" class="imgg"  style="width: 500px">
                   <img src="images/fit.jpg" alt="sport" class="imgg"  style="width: 500px">
               </div>
               <p><b>Танцы.</b>

               Танцы — это прекрасный вариант чтобы не только подтянуть тело, но и отпустить стеснение, страхи и убрать зажимы в мышцах. На танцах отлично сочетается кардио и тренировка на внимательность, также во время заучивания связок тренируется память. На занятиях можно найти себе друзей и хороших знакомых, с которыми можно не только танцевать, но и проводить время вместе. Танцевальная тусовка – это нечто большее, чем просто спорт. Это позитив, настроение и поэтому танец один из лучших вариантов активности для взрослого человека.
               </p>
               <div class="img">

                   <img src="images/dance2.jpg" alt="sport" class="imgg"  style="width: 500px">
                   <img src="images/dance1.jpg" alt="sport" class="imgg"  style="width: 500px">
               </div>
               <p><b>Баскетбол.</b> Это уникальный вид спорта: в нем задействованы самые разные
                   группы мышц. Кроме всего этого, в баскетболе, прежде всего, нужно еще и думать
                   головой. Это нужно для того, чтобы разработать тактику игры для своей команды
                   (нападение и защиту).</p>
               <div class="img">

                   <img src="images/bas.jpg" alt="sport" class="imgg"  style="width: 500px">
                   <img src="images/bas1.jpg" alt="sport" class="imgg"  style="width: 500px">
               </div>
               <p></p>
           </div>


           <div class="prog">
               <h2 id = "zag2"> 2. Программирование</h2>

               <p>В программировании я вижу творческий процесс, инструмент, с помощью которого я могу реализовать какие-то свои задумки.</p>
               <p><b>Веб-программирование. </b>Простыми словами, веб программирование — это создание сайтов и программ, функционирующих в сети Интернет. Все сайты, с которыми Вы ежедневно имеете дело, созданы именно благодаря технологиям веб-программирования. Однако главное отличие между ними заключается в наборе функций и возможностей, которые предлагает для целевой аудитории тот или иной сайт. Сегодня бизнес страницы с просто красивым текстом и яркой картинкой не привлекут внимание клиента так, как сделают это сайты, в основу которых положены интерактивные компоненты. То есть такие компоненты, которые помогают «установить связь» с потенциальным пользователем и поддерживать с ним надлежащее взаимодействие. Сюда и приходят на помощь веб-разработчики, задачей которых является спроектировать живой и многофункциональный сайт и оснастить его эффективными интерактивными инструментами обратной связи, подписки, рассылки и многим другим.</p>

               <p><b>Объе́ктно-ориенти́рованное программи́рование (ООП). </b>Это — методология программирования, основанная на представлении программы в виде совокупности объектов, каждый из которых является экземпляром определённого класса, а классы образуют иерархию наследования. </p>

               <p><b>Аналитическое программирование. </b>Это было выбрано потому, что АП представлял синтез аналитического решения, основываясь на эволюционном алгоритме. АП был основан на специальном наборе математических объектов и операций. Набор операций представлял собой функции, операторы и терминалы (также как в ГП), которые обычно являлись константами или независимыми переменными.</p>

               <p><b>Разработка игр. </b>Современная разработка мобильных мини-игр – это больше работа художника, чем программиста. Для программной реализации достаточно самых базовых представления о разработке. Конечно, если делается большой и качественный продукт с коммерческой целью – все совсем по-другому. ... Делать игру – это интересно. Иногда даже более интересно, чем играть в нее. В отличии от работы в команде над крупным проектом это дает маленькую радость личной победы. </p>

               <p><b>Системное программирование. </b>Это деятельность по программированию программного обеспечения компьютерной системы. </p>

               <p><img src="images/prog.jpg" alt="programming" style="width: 800px"> </p>
               <p></p>




           </div>


          <div class="prog">
              <h2 id = "zag3"> 3. Наука</h2>

              <p>Обучаясь в вузе, многие студенты самостоятельно изучают определенные науки, для них это как увлечение, им нравится познавать все больше и больше вне зависимости от выбранной специальности. Например, знакомый учится на программиста, но ему параллельно нравится изучать и читать про философию.</p>
              <p><b>Химия. </b>Любительская химия обычно делается с любыми химическими веществами, имеющимися в распоряжении в уединении дома.</p>

              <p><b>Физика. </b>Поскольку вы изучаете физику как хобби, а не ограничены во времени требованиями к степени, у вас будет все время в мире, и вы сможете идти в своем собственном неторопливом темпе. </p>

              <p><b>Биолоия. </b>Биология – это обширная наука о жизни, включающая множество отдельных, но взаимосвязанных наук. Биология как наука включает все знания о природе, структуре, поведении и функции всех живых существ на планете Земля. Каждому человеку необходимо какое-то увлечение в жизни, способное доставлять удовольствие и забивать голову приятными мелочами, никак не связанными с бытовыми проблемами..</p>

              <p><b>Философия. </b>Философия сама по себе чересчур абстрактна и изучить ее от корки до корки полностью не получится. Главное в ее изучении — стараться найти понимание и какой-то отклик по отношению к прочитанному.. </p>

              <p><b>Математика. </b>Увлечение математикой в школе и вузе даёт действительно сильный толчок, фактически для многих - это решающий толчок в их жизненном пути. Благодаря дипломам Всероссийской олимпиады они без экзаменов поступают в вуз, приобретённая база помогает им его успешно закончить, они могут найти хорошую работу, ведь математическое и IT-образование - одно из самых ценных. </p>


              <p></p>


          </div>


          <div class="prog">
              <h2 id = "zag4"> 4. Кулинария</h2>

              <p>Кулинария — хобби, которое позволяет баловать всех членов семьи.
                  Не просто сделать бутерброды на завтрак, а приготовить омлет с овощами и сыром и испечь ароматные вафли.
                  Или вместо привычного картофельного пюре и котлет на ужин приготовить тыквенные рулетики
                  с печенью и запеченными овощами. То есть, это хобби позволяет разнообразить питание всей семьи.
                  И радовать близких своими шедеврами.</p>
              <div class="img">
                  <p><b>Десерты. </b>
                  <img src="images/des.jpg" alt="десерты" style="width: 500px; height: 280px"></p>
                  <p><b>Экзотика. </b>
                  <img src="images/zot.jpg" alt="экзотические блюда" style="width: 500px; height: 280px"></p>

              </div>
              <div class="img">
                  <p><b>Выпечка. </b>
                      <img src="images/bread.jpg" alt="выпечка" style="width: 500px"></p>

                  <p><b>Блюда. </b>
                      <img src="images/dinner.jpg" alt="блюда" style="width: 500px; height: 280px"></p>

              </div>

              <p><b>Напитки. </b> </p>
              <img src="images/drink.jpg" alt="напитки" style="width: 500px">

              <p></p>

          </div>


          <div class="prog">
              <h2 id = "zag5"> 5. Творчество</h2>

              <p>Любая деятельность в свободное время, связанная с творчеством и приносящая вам удовольствие, относится к творческим видам хобби. Такие увлечения позволяют разить воображение и повысить креативный потенциал, но самое важное, конечно, это положительные эмоции от занятий любимым делом.

                  Все многообразие творческих хобби трудно перечислить, но остановимся на самых популярных и доступных, заняться которыми можно в любое время и в любом возрасте.
                   </p>
              <p><b>Музыка. </b>одно из необычных направлений и видов данной деятельности. Человек может слушать музыку, коллекционировать альбомы или же, например, самому сочинять музыку и играть на различных инструментах. </p>

              <p><b>Писательство. </b>Для многих студентов писательство – это не просто хобби, но и настоящий стиль жизни, а иногда и источник заработка.</p>

              <p><b>Рукоделие. </b>Занятие рукоделием — одно из видов хобби. Вышивание, вязание, шитье или изготовление открыток — хороший способ отвлечься от дел, забыть о проблемах и реализовать творческий потенциал. Рукоделие позволяет не только расслабиться и приятно отдохнуть, но и сэкономить семейный бюджет — многие мастерицы предпочитают проводить время с пользой, создавая предметы интерьера, одежду, аксессуары.</p>

              <p><b>Рисование. </b> Это очень интересное хобби и увлечение. Оно помогает успокоиться и развить моторику, воображение. Рисование помогает выражать свои эмоции, настроение. В психологии даже есть специальная терапия, которая помогает вылечить человека благодаря выражению эмоций на листке. В данном виде искусства появилось много разных направлений. Любой сможет найти для себя что-то свое.</p>

              <p><b>Фотография. </b>Данное увлечение появилось не так давно. До его существования неподвижный момент можно было изобразить только на холсте. Людей, которые видят прекрасное во всём, очень много. Сто лет назад не было возможности передать всю красоту окружающего мира, но сейчас, в век цифровых технологий, есть возможность это сделать за несколько простых действий. </p>


              <p></p>


          </div>



          <div class="prog">
              <h2 id = "zag6"> 6. Коллекционирование</h2>

              <p>Самым распространённым хобби сейчас, пожалуй, является коллекционирование. Чего только не собирают люди – бутылки, монеты, машины. Всё, к чему душа лежит, и на что хватает бюджета, конечно же. Предмет коллекционирования – личное предпочтение каждого. Однако в разные исторические периоды наблюдались некоторого рода массовые тенденции, которые прослеживались как раз в том, что люди собирали и бережно хранили у себя в домах. По этим коллекциям исследователи могут делать своего рода «срезы» эпох, поскольку с годами все менялось, а отследить культурные предпочтения и направления общественного развития можно как раз учитывая предметы сбора.</p>
              <table border="1" cellpadding="0" cellspacing="0">
                  <tr ><th>Марки</th><td><img src="images/marks.jpg" alt="марки" style="width: 500px; height: 280px"></td></tr>
                  <tr><th>Минеральные камни</th><td><img src="images/kamni.jpg" alt="камни" style="width: 500px; height: 280px"></td></tr>
                  <tr><th>Журналы</th><td> <img src="images/journal.jpg" alt="журналы" style="width: 500px; height: 280px"></td></tr>
                  <tr><th>Значки</th><td><img src="images/znach.jpg" alt="значки" style="width: 500px; height: 280px"></td></tr>
                  <tr><th>Магниты</th><td><img src="images/travel.jpg" alt="магниты" style="width: 500px; height: 280px"></td></tr>

              </table>
              <p></p>

          </div>

          <div class="prog">
              <h2 id = "zag7"> 7. Блог</h2>

              <p>Свободное время каждый проводит по-разному. Кто-то выбирает пассивный отдых за телевизором,
                  кто-то путешествует, кто-то занимается спортом, а кто-то пишет в блоге. С начала 21 века стало
                  популярным открывать собственный блог или сайт.</p>
              <p> Самые популярные сейчас платформы для ведения блога, показа своей жизни:
                  инстаграм, youtube, Tik-Tok, telegram.</p>
              <p> Кто-то снимает видео, кто-то ведет блог о путешествиях, ресторанах и т.п., кому что нравится.</p>


              <p></p>

          </div>


           <div class="button">
              <form  action = "bd.php">
                 <p> <button>Выбери свое хобби</button> </p>
              </form>
           </div>

      </main>
  </div>

<?php
require_once 'footer.php'
?>

</body>
</html>
